{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0010\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 43, 160, 3], "name": "lambda_1", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [2, 2], "nb_filter": 24, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "nb_col": 5, "init": "he_normal", "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 2], "nb_filter": 36, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "init": "he_normal", "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 2], "nb_filter": 48, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_col": 5, "init": "he_normal", "nb_row": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "init": "he_normal", "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "subsample": [1, 1], "nb_filter": 64, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "init": "he_normal", "nb_row": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "name": "activation_5", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "output_dim": 1164, "b_constraint": null, "activation": "linear", "W_constraint": null, "input_dim": 6656, "activity_regularizer": null, "name": "dense_1", "init": "he_normal", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_6", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "output_dim": 100, "b_constraint": null, "activation": "linear", "W_constraint": null, "input_dim": 1164, "activity_regularizer": null, "name": "dense_2", "init": "he_normal", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_7", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "output_dim": 50, "b_constraint": null, "activation": "linear", "W_constraint": null, "input_dim": 100, "activity_regularizer": null, "name": "dense_3", "init": "he_normal", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_8", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "output_dim": 10, "b_constraint": null, "activation": "linear", "W_constraint": null, "input_dim": 50, "activity_regularizer": null, "name": "dense_4", "init": "he_normal", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_9", "trainable": true}, "class_name": "Activation"}, {"config": {"bias": true, "W_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "activation": "linear", "W_constraint": null, "input_dim": 10, "activity_regularizer": null, "name": "dense_5", "init": "he_normal", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}