{"config": [{"class_name": "Lambda", "config": {"arguments": {}, "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 43, 160, 3], "name": "lambda_1", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0014\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_1", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "nb_col": 5, "nb_row": 5, "trainable": true, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_2", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "nb_col": 5, "nb_row": 5, "trainable": true, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_3", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "nb_col": 5, "nb_row": 5, "trainable": true, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 2]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_4", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "trainable": true, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "activity_regularizer": null, "bias": true, "activation": "linear", "name": "convolution2d_5", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "trainable": true, "init": "he_normal", "W_regularizer": null, "W_constraint": null, "border_mode": "valid", "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activation": "linear", "name": "dense_1", "b_constraint": null, "W_constraint": null, "output_dim": 1164, "input_dim": 6656, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activation": "linear", "name": "dense_2", "b_constraint": null, "W_constraint": null, "output_dim": 100, "input_dim": 1164, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activation": "linear", "name": "dense_3", "b_constraint": null, "W_constraint": null, "output_dim": 50, "input_dim": 100, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activation": "linear", "name": "dense_4", "b_constraint": null, "W_constraint": null, "output_dim": 10, "input_dim": 50, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "activation": "linear", "name": "dense_5", "b_constraint": null, "W_constraint": null, "output_dim": 1, "input_dim": 10, "activity_regularizer": null, "trainable": true, "init": "he_normal", "W_regularizer": null}}], "class_name": "Sequential", "keras_version": "1.2.0"}