{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "input_dtype": "float32", "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "batch_input_shape": [null, 43, 160, 3], "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0010\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "subsample": [2, 2], "bias": true, "activation": "linear", "init": "he_normal", "nb_col": 5, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 24, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "subsample": [1, 2], "bias": true, "activation": "linear", "init": "he_normal", "nb_col": 5, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 36, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "subsample": [1, 2], "bias": true, "activation": "linear", "init": "he_normal", "nb_col": 5, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 48, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "subsample": [1, 1], "bias": true, "activation": "linear", "init": "he_normal", "nb_col": 3, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "subsample": [1, 1], "bias": true, "activation": "linear", "init": "he_normal", "nb_col": 3, "dim_ordering": "tf", "trainable": true, "b_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 6656, "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1164}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"input_dim": 1164, "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 100}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Dense", "config": {"input_dim": 100, "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 50}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Dense", "config": {"input_dim": 50, "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 10}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Dense", "config": {"input_dim": 10, "bias": true, "init": "he_normal", "activation": "linear", "trainable": true, "b_regularizer": null, "name": "dense_5", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1}}]}